In [99]:
import numpy as np
import pandas as pd

In [100]:
data_sachin = pd.read_csv(r"C:\Users\DELL\Desktop\Scaler common core maths\Sachin_ODI.csv")

In [101]:
data_sachin

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,No,No
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,No,Yes
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,No,Yes
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,Yes,No
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,No,Yes

In [102]:
data_sachin.shape

(360, 14)

# 1. Probability of win:  p[w]

In [103]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [104]:
data_sachin["Won"].value_counts()

Yes    184
No     176
Name: Won, dtype: int64

# So from the above we can clearly fing the probability as 51.1 %.

In [105]:
184/(184+176)

0.5111111111111111

# Note - But this is not the right way to do as it is lengthy. Let us see how we can do it with help of pandas.

In [106]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [107]:
data_won = data_sachin[data_sachin["Won"] == "Yes"]

In [108]:
data_won

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
5,112,1,137,107,15,1,104.67,2,Sri Lanka,Sharjah,1995-04-09,India,Yes,Yes
6,41,0,51,41,5,0,100.00,2,Sri Lanka,Sharjah,1995-04-14,India,No,Yes
8,39,0,79,51,4,0,76.47,2,New Zealand,Amritsar,1995-11-18,India,No,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
349,18,0,21,14,2,0,128.57,2,Sri Lanka,Mumbai,2011-04-02,India,No,Yes
351,48,0,87,63,5,0,76.19,2,Sri Lanka,Perth,2012-02-08,India,No,Yes
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,No,Yes
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,No,Yes
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,No,Yes

In [109]:
len(data_won)

184

In [110]:
len(data_sachin)

360

# Now computing the Probability as follows.

In [111]:
len(data_won)/len(data_sachin)

0.5111111111111111

# 2. Probability of scoring a century. p[c]

In [112]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [113]:
data_sachin["Century"].value_counts()

No     314
Yes     46
Name: Century, dtype: int64

In [114]:
data_century = data_sachin[data_sachin["Century"] == "Yes"]
data_century

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
5,112,1,137,107,15,1,104.67,2,Sri Lanka,Sharjah,1995-04-09,India,Yes,Yes
12,127,1,175,138,15,1,92.02,2,Kenya,Cuttack,1996-02-18,India,Yes,Yes
15,137,0,198,137,8,5,100.00,1,Sri Lanka,Delhi,1996-03-02,Sri Lanka,Yes,No
20,100,0,-,111,9,1,90.09,1,Pakistan,Singapore,1996-04-05,Pakistan,Yes,No
23,118,0,-,140,8,2,84.28,1,Pakistan,Sharjah,1996-04-15,India,Yes,Yes
27,110,0,-,138,5,1,79.71,1,Sri Lanka,Colombo (RPS),1996-08-28,Sri Lanka,Yes,No
41,114,0,157,126,14,0,90.47,1,South Africa,Mumbai,1996-12-14,India,Yes,Yes
47,104,0,121,97,8,1,107.21,2,Zimbabwe,Benoni,1997-02-09,India,Yes,Yes
55,117,0,188,137,13,2,85.40,2,New Zealand,Bengaluru,1997-05-14,India,Yes,Yes
85,100,0,132,89,5,7,112.35,2,Australia,Kanpur,1998-04-07,India,Yes,Yes
91,143,0,187,131,9,5,109.16,2,Australia,Sharjah,1998-04-22,Australia,Yes,No
92,134,0,195,131,12,3,102.29,2,Australia,Sharjah,1998-04-24,India,Yes,Yes
95,100,1,156,103,13,0,97.08,2,Kenya,Kolkata,1998-05-31,India,Yes,Yes
99,128,0,182,131,8,2,97.70,1,Sri Lanka,Colombo (RPS),1998-07-07,India,Yes,Yes
101,127,1,155,130,13,1,97.69,2,Zimbabwe,Bulawayo,1998-09-26,India,Yes,Yes
104,141,0,191,128,13,3,110.15,1,Australia,Dhaka,1998-10-28,India,Yes,Yes
107,118,1,173,112,14,2,105.35,2,Zimbabwe,Sharjah,1998-11-08,India,Yes,Yes
110,124,1,140,92,12,6,134.78,2,Zimbabwe,Sharjah,1998-11-13,India,Yes,Yes
116,140,1,114,101,16,3,138.61,1,Kenya,Bristol,1999-05-23,India,Yes,Yes
123,120,0,191,141,11,2,85.10,1,Sri Lanka,Colombo (SSC),1999-08-29,India,Yes,Yes
128,186,1,221,150,20,3,124.00,1,New Zealand,Hyderabad (Deccan),1999-11-08,India,Yes,Yes
143,122,0,195,138,12,0,88.40,2,South Africa,Vadodara,2000-03-17,India,Yes,Yes
155,101,0,-,140,3,1,72.14,1,Sri Lanka,Sharjah,2000-10-20,Sri Lanka,Yes,No
162,146,0,200,153,15,2,95.42,1,Zimbabwe,Jodhpur,2000-12-08,Zimbabwe,Yes,No
167,139,0,197,125,19,0,111.20,1,Australia,Indore,2001-03-31,India,Yes,Yes
173,122,1,210,131,12,1,93.12,2,West Indies,Harare,2001-07-04,India,Yes,Yes
175,101,0,209,129,9,0,78.29,1,South Africa,Johannesburg,2001-10-05,South Africa,Yes,No
179,146,0,186,132,17,0,110.60,1,Kenya,Paarl,2001-10-24,India,Yes,Yes
191,105,1,167,108,8,1,97.22,1,England,Chester-le-Street,2002-07-04,no result,Yes,No
194,113,0,141,102,12,1,110.78,1,Sri Lanka,Bristol,2002-07-11,India,Yes,Yes
206,152,0,193,151,18,0,100.66,1,Namibia,Pietermaritzburg,2003-02-23,India,Yes,Yes
215,100,0,158,119,9,1,84.03,1,Australia,Gwalior,2003-10-26,India,Yes,Yes
219,102,0,124,91,12,1,112.08,1,New Zealand,Hyderabad (Deccan),2003-11-15,India,Yes,Yes
229,141,0,173,135,17,1,104.44,2,Pakistan,Rawalpindi,2004-03-16,Pakistan,Yes,No
245,123,0,192,130,12,2,94.61,1,Pakistan,Ahmedabad,2005-04-12,Pakistan,Yes,No
258,100,0,188,113,10,1,88.49,1,Pakistan,Peshawar,2006-02-06,Pakistan,Yes,No
262,141,1,-,148,13,5,95.27,1,West Indies,Kuala Lumpur,2006-09-14,West Indies,Yes,No
276,100,1,110,76,10,1,131.57,1,West Indies,Vadodara,2007-01-31,India,Yes,Yes
313,117,1,235,120,10,0,97.50,2,Australia,Sydney,2008-03-02,India,Yes,Yes
322,163,1,206,133,16,5,122.55,1,New Zealand,Christchurch,2009-03-08,India,Yes,Yes
325,138,0,214,133,10,1,103.75,1,Sri Lanka,Colombo (RPS),2009-09-14,India,Yes,Yes
331,175,0,210,141,19,4,124.11,2,Australia,Hyderabad (Deccan),2009-11-05,Australia,Yes,No
338,200,1,226,147,25,3,136.05,1,South Africa,Gwalior,2010-02-24,India,Yes,Yes
342,120,0,170,115,10,5,104.34,1,England,Bengaluru,2011-02-27,tied,Yes,No
345,111,0,184,101,8,3,109.90,1,South Africa,Nagpur,2011-03-12,South Africa,Yes,No
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,Yes,No

In [115]:
data_sachin[data_sachin["Century"] == "Yes"].shape

(46, 14)

In [116]:
len(data_century)

46

In [117]:
len(data_sachin)

360

In [118]:
data_century_probability = len(data_century)/len(data_sachin)

In [119]:
data_century_probability

0.12777777777777777

# 3. Probability of winning and century.: p[w^c]

In [120]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [121]:
data_sachin[["Century" , "Won"]].value_counts()

Century  Won
No       No     160
         Yes    154
Yes      Yes     30
         No      16
dtype: int64

# Now making the above insight more redable. "crossstab" is being used.

In [122]:
pd.crosstab(index = data_sachin["Century"] , columns = data_sachin["Won"])

Won       No  Yes
Century
No       160  154
Yes       16   30

In [123]:
pd.crosstab(index = data_sachin["Century"] , columns = data_sachin["Won"] , margins = True)

Won       No  Yes  All
Century
No       160  154  314
Yes       16   30   46
All      176  184  360

# Using the Pandas.

In [130]:
data_cetury_won = data_sachin.head(2)

In [133]:
data_century_won = data_sachin[(data_sachin["Century"] == "Yes") & (data_sachin["Won"] == "Yes")]

In [134]:
data_century_won

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
5,112,1,137,107,15,1,104.67,2,Sri Lanka,Sharjah,1995-04-09,India,Yes,Yes
12,127,1,175,138,15,1,92.02,2,Kenya,Cuttack,1996-02-18,India,Yes,Yes
23,118,0,-,140,8,2,84.28,1,Pakistan,Sharjah,1996-04-15,India,Yes,Yes
41,114,0,157,126,14,0,90.47,1,South Africa,Mumbai,1996-12-14,India,Yes,Yes
47,104,0,121,97,8,1,107.21,2,Zimbabwe,Benoni,1997-02-09,India,Yes,Yes
55,117,0,188,137,13,2,85.40,2,New Zealand,Bengaluru,1997-05-14,India,Yes,Yes
85,100,0,132,89,5,7,112.35,2,Australia,Kanpur,1998-04-07,India,Yes,Yes
92,134,0,195,131,12,3,102.29,2,Australia,Sharjah,1998-04-24,India,Yes,Yes
95,100,1,156,103,13,0,97.08,2,Kenya,Kolkata,1998-05-31,India,Yes,Yes
99,128,0,182,131,8,2,97.70,1,Sri Lanka,Colombo (RPS),1998-07-07,India,Yes,Yes
101,127,1,155,130,13,1,97.69,2,Zimbabwe,Bulawayo,1998-09-26,India,Yes,Yes
104,141,0,191,128,13,3,110.15,1,Australia,Dhaka,1998-10-28,India,Yes,Yes
107,118,1,173,112,14,2,105.35,2,Zimbabwe,Sharjah,1998-11-08,India,Yes,Yes
110,124,1,140,92,12,6,134.78,2,Zimbabwe,Sharjah,1998-11-13,India,Yes,Yes
116,140,1,114,101,16,3,138.61,1,Kenya,Bristol,1999-05-23,India,Yes,Yes
123,120,0,191,141,11,2,85.10,1,Sri Lanka,Colombo (SSC),1999-08-29,India,Yes,Yes
128,186,1,221,150,20,3,124.00,1,New Zealand,Hyderabad (Deccan),1999-11-08,India,Yes,Yes
143,122,0,195,138,12,0,88.40,2,South Africa,Vadodara,2000-03-17,India,Yes,Yes
167,139,0,197,125,19,0,111.20,1,Australia,Indore,2001-03-31,India,Yes,Yes
173,122,1,210,131,12,1,93.12,2,West Indies,Harare,2001-07-04,India,Yes,Yes
179,146,0,186,132,17,0,110.60,1,Kenya,Paarl,2001-10-24,India,Yes,Yes
194,113,0,141,102,12,1,110.78,1,Sri Lanka,Bristol,2002-07-11,India,Yes,Yes
206,152,0,193,151,18,0,100.66,1,Namibia,Pietermaritzburg,2003-02-23,India,Yes,Yes
215,100,0,158,119,9,1,84.03,1,Australia,Gwalior,2003-10-26,India,Yes,Yes
219,102,0,124,91,12,1,112.08,1,New Zealand,Hyderabad (Deccan),2003-11-15,India,Yes,Yes
276,100,1,110,76,10,1,131.57,1,West Indies,Vadodara,2007-01-31,India,Yes,Yes
313,117,1,235,120,10,0,97.50,2,Australia,Sydney,2008-03-02,India,Yes,Yes
322,163,1,206,133,16,5,122.55,1,New Zealand,Christchurch,2009-03-08,India,Yes,Yes
325,138,0,214,133,10,1,103.75,1,Sri Lanka,Colombo (RPS),2009-09-14,India,Yes,Yes
338,200,1,226,147,25,3,136.05,1,South Africa,Gwalior,2010-02-24,India,Yes,Yes

In [135]:
len(data_century_won)

30

In [136]:
prob_century_won = len(data_century_won) / len(data_sachin)

In [137]:
prob_century_won

0.08333333333333333

# Probability of "Not scoring century" and "losing".

In [142]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [145]:
century_no_loss = data_sachin[(data_sachin["Century"] == "No") & (data_sachin["Won"] == "No")]

In [146]:
century_no_loss

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No
7,30,0,30,20,5,0,150.00,1,New Zealand,Jamshedpur,1995-11-15,New Zealand,No,No
10,65,0,96,59,9,1,110.16,2,New Zealand,Nagpur,1995-11-26,New Zealand,No,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
350,2,0,9,6,0,0,33.33,2,Australia,Melbourne,2012-02-05,Australia,No,No
352,15,0,25,24,2,0,62.50,2,Sri Lanka,Adelaide,2012-02-14,tied,No,No
353,3,0,21,12,0,0,25.00,2,Australia,Brisbane,2012-02-19,Australia,No,No
354,22,0,33,23,3,0,95.65,2,Sri Lanka,Brisbane,2012-02-21,Sri Lanka,No,No
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,No,No

In [147]:
len(century_no_loss)

160

In [148]:
len(data_sachin)

360

In [149]:
prob_nocen_loss = len(century_no_loss) / len(data_sachin)

In [150]:
prob_nocen_loss

0.4444444444444444

# Probability of "Not scoring century" and "losing".

In [152]:
data_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No

In [155]:
century_noor_loss = data_sachin[(data_sachin["Century"] == "No") | (data_sachin["Won"] == "No")]

In [156]:
century_noor_loss

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Century,Won
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,No,No
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,No,No
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,No,Yes
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,No,Yes
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,No,No
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,No,No
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,No,Yes
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,No,Yes
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,Yes,No
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,No,Yes

In [157]:
len(century_noor_loss)

330

In [159]:
len(data_sachin)

360

In [160]:
prob_noor_loss = len(century_noor_loss) / len(data_sachin)

In [161]:
prob_noor_loss

0.9166666666666666